#+AUTHOR: wfj
#+EMAIL: wufangjie1223@126.com
#+HTML_HEAD_EXTRA: <style type="text/css"> body {padding-left: 26%; !important;} #table-of-contents {position: fixed; width: 25%; height: 100%; top: 0; left: 0; overflow-y: scroll;} .org-src-container {color: #ffffff !important; background: #131926 !important; } pre:before{color: #ffffff !important; background: #131926 !important;} </style>
#+HTML_MATHJAX: path: "file:///usr/local/share/MathJax/MathJax.js"
#+OPTIONS: ^:{} \n:t email:t

**** 公式 (未完成, 竟然还可以用 elisp 函数, 太无解了)
@row$column 正数负数表示正数倒数, 0 表示当前行, @#, $# 表示行号, 列号\\
# NOTE 负数表示当前行或列之前的行数, 而不是最大行列的之前多少, <> 分别表示最大最小, @<<$>>
M-x org-table-edit-formulas 编辑公式能看到高亮范围\\
Org-mode 默认使用的是 Emacs 中自带的 Calc 这个 package 来进行计算, M-x describe-function calc-TAB\\
    # 基础算术方法: abs, sign, inv, sqrt, min, max，详见 Arithmetic Functions
    # 对数方法: ln, exp, log，详见 Logarithmic Functions
    # 三角函数: sin, cos, tahn，详见 Trigonometric/Hyperbolic Functions
    # 随机数方法: random
    # 向量/矩阵方法: vunion, vint, vsum, vmean, vmax, vmin, vmedian，详见 Vector/Matrix Functions
#+NAME: 1
| 1 |  2 |  3 |          4 |    5 |        |
|---+----+----+------------+------+--------|
| 2 | 91 | 39 | 0.42857143 | 9139 | #ERROR |
| 3 |  1 | 96 |         96 |  196 |        |
| 4 |  8 | 60 |        7.5 |  860 |        |
| 5 | 70 | 89 |  1.2714286 | 7089 |        |
| 6 | 18 | 22 |  1.2222222 | 1822 |        |
| 7 | 10 | 42 |        4.2 | 1042 |        |
| 8 | 11 |  2 | 0.18181818 |  112 |        |
| 9 | 43 | 35 | 0.81395349 | 4335 |        |
#+TBLFM: @1 = $#
#+TBLFM: $1 = @#
#+TBLFM: $4 = $3 / $2
#+TBLFM: $5 = '(concat $2..$3)
#+TBLFM: @2$6 = '(calc-vector-variance @2$2..@-1$2)

(calc-vector-variance '(1 2 3))

#+TBLFM: @9$2 = vsum(@2..@-1)
#+TBLFM: $4 = $3 / $2 * $2

|   | 2 | 3 | 4 | 5 |
|---+---+---+---+---|
|   |   |   |   |   |
#+TBLFM: @1 = '(identity remote(1, @$#$1))
#+TBLFM: @1 = remote(1, @$#$1)

